package com.yy.server.common;

public enum ErrorEnum {
    ERROR_1(1, "数据库语句执行失败"),
    //**********  短信  ************
    ERROR_26001(26001, "请求参数有误"),
    ERROR_99999(99999, "系统异常"),
    ERROR_26005(26005, "查询数据为空"),


    //**********  用户登录/注册/注销/忘记密码密码  ************
    ERROR_31423(31423, "暂无数据"),
    ERROR_31433(31433, "创建失败"),
    ERROR_31432(31432, "修改失败"),

    ERROR_21001(21001, "注册失败"),
    ERROR_21002(21002, "验证码错误"),
    ERROR_21003(21003, "验证码超时,或错误"),
    ERROR_21004(21004, "该用户已注册"),
    ERROR_21005(21005, "该用户未注册"),
    ERROR_21011(21011, "未知账户"),
    ERROR_21012(21012, "密码不正确"),
    ERROR_21013(21013, "用户已锁定"),
    ERROR_21014(21014, "用户或密码错误次数过多"),
    ERROR_21015(21015, "用户名密码不正确"),
    ERROR_21016(21016, "登录失败"),
    ERROR_21017(21017, "重复登录"),
    ERROR_21021(21021, "登出失败"),
    ERROR_21031(21031, "重置密码失败"),
    ERROR_21099(21099, "未登录"),
    ERROR_21101(21101, "Id不能为空"),
    ERROR_21102(21102, "用户名已存在"),
    ERROR_21103(21103, "杂项创建失败"),
    ERROR_21104(21104, "用户名不正确"),
    ERROR_21105(21105, "密码不正确"),

    ERROR_21114(21114, "杂项删除失败"),

    ERROR_22011(22011, "未知设备"),
    ERROR_22012(22012, "设备密码不正确"),
    ERROR_22013(22013, "设备已锁定"),
    ERROR_22014(22014, "密码错误次数过多"),
    ERROR_22015(22015, "密码不正确"),

    //**********  版本控制/广告/帮助:21400-21499  ************
    ERROR_21401(21401, "获得版本失败"),

    //**********  Admin错误码:31400- ************
    ERROR_31400(31400, "AdminId为空"),
    ERROR_31414(31414, "Admin修改状态失败"),
    ERROR_31415(31415, "Admin修改失败"),
    ERROR_31416(31416, "创建角色失败"),
    ERROR_31417(31416, "角色ID为空"),
    ERROR_31418(31418, "修改角色失败"),
    ERROR_31419(31419, "修改角色状态失败"),
    ERROR_31420(31420, "密码重置失败"),
    ERROR_31421(31421, "用户未登录"),
    ERROR_31422(31422, "您对该账户没有权限"),
    ERROR_31430(3130, "信息已存在"),

    ERROR_36003(36003, "公司信息操作失败"),


    //关于管理
    ERROR_37000(37000, "关于配置查询错误"),
    ERROR_37001(37001, "关于配置修改错误"),
    ERROR_37002(37002, "关于配置新增错误"),
    ERROR_37003(37003, "关于配置参数不能为空"),
    ERROR_37004(37004, "关于配置删除数据失败"),
    ERROR_37005(37005, "关于配置修改查询错误"),
    ERROR_37006(37006, "appId不能为空");


    private Integer code;//结果编码
    private String msg;//结果信息

    ErrorEnum(Integer code, String msg) {
        this.code = code;
        this.msg = msg;
    }

    public Integer getCode() {
        return code;
    }

    public String getMsg() {
        return msg;
    }
}